Repository: hiro5791/HexEditor
Catalog: src/HexEditor.App/Strings/*/Resources.resw
Source language: en
Languages: ar, cs, de, el, es, fa, fr, hu, id, it, ja, ja_jp, ko, pl, pt, ro, ru, th, tr, uk, vi, zh_hans, zh_hant

# Hash_ByteOrder.Header
source: Byte order (64-bit or less)
ar: ترتيب البايتات (64 بت أو أقل)
cs: Pořadí bajtů (64 bitů nebo méně)
de: Bytereihenfolge (64 Bit oder weniger)
el: Σειρά byte (έως 64 bit)
es: Orden de bytes (64 bits o menos)
fa: ترتیب بایت (64 بیتی یا کمتر)
fr: Ordre des octets (64 bits ou moins)
hu: Bájtsorrend (legfeljebb 64 bites)
id: Urutan byte (64-bit atau kurang)
it: Ordine dei byte (64 bit o meno)
ja: バイト順 (64 bit 以下)
ko: 바이트 순서(64비트 이하)
pl: Kolejność bajtów (do 64 bitów)
pt: Ordem dos bytes (64 bits ou menos)
ro: Ordinea octeților (64 de biți sau mai puțin)
ru: Порядок байтов (не более 64 бит)
th: ลำดับไบต์ (64 บิตหรือน้อยกว่า)
tr: Bayt sırası (64 bit veya daha az)
uk: Порядок байтів (до 64 біт)
vi: Thứ tự byte (tối đa 64 bit)
zh_hans: 字节顺序（64 位或以下）
zh_hant: 位元組順序（64 位元以下）

# Hash_ByteOrder_Big.Content
source: Big-endian (number)
ar: Big-endian (رقم)
cs: Big-endian (číslo)
de: Big-Endian (Zahl)
el: Big-endian (αριθμός)
es: Big-endian (número)
fa: Big-endian (عدد)
fr: Gros-boutiste (nombre)
hu: Big-endian (szám)
id: Big-endian (angka)
it: Big-endian (numero)
ja: ビッグエンディアン (数値)
ko: 빅 엔디언(숫자)
pl: Big-endian (liczba)
pt: Big-endian (número)
ro: Big-endian (număr)
ru: Big-endian (число)
th: Big-endian (ตัวเลข)
tr: Big-endian (sayı)
uk: Big-endian (число)
vi: Big-endian (số)
zh_hans: 大端序（数值）
zh_hant: 大端序（數值）

# Hash_ByteOrder_Little.Content
source: Little-endian bytes
ar: بايتات Little-endian
cs: Bajty little-endian
el: Byte σε little-endian
es: Bytes en little-endian
fa: بایت‌های Little-endian
fr: Octets en petit-boutiste
hu: Little-endian bájtok
id: Byte little-endian
it: Byte little-endian
ja: リトルエンディアンのバイト列
ko: 리틀 엔디언 바이트
pl: Bajty little-endian
pt: Bytes little-endian
ro: Octeți little-endian
ru: Байты little-endian
th: ไบต์แบบ Little-endian
tr: Little-endian baytlar
uk: Байти little-endian
vi: Byte little-endian
zh_hans: 小端序字节
zh_hant: 小端序位元組

# Hash_Results.Text
source: Results
ar: النتائج
cs: Výsledky
de: Ergebnisse
el: Αποτελέσματα
es: Resultados
fa: نتایج
fr: Résultats
hu: Eredmények
id: Hasil
it: Risultati
ja: 結果
ko: 결과
pl: Wyniki
pt: Resultados
ro: Rezultate
ru: Результаты
th: ผลลัพธ์
tr: Sonuçlar
uk: Результати
vi: Kết quả
zh_hans: 结果
zh_hant: 結果

# Hash_Bits
source: {0} bit
ar: {0} بت
cs: {0} b
es: {0} bits
fa: {0} بیت
fr: {0} bits
ko: {0}비트
pl: {0}-bitowy
pt: {0} bits
ro: {0} biți
ru: {0} бит
th: {0} บิต
uk: {0} біт
zh_hans: {0} 位
zh_hant: {0} 位元

# Hash_Changed.Text
source: Changed
ar: تغيّر
cs: Změněno
de: Geändert
el: Άλλαξε
es: Cambiado
fa: تغییریافته
fr: Modifié
hu: Változott
id: Berubah
it: Modificato
ja: 変更
ko: 변경됨
pl: Zmieniono
pt: Alterado
ro: Modificat
ru: Изменено
th: เปลี่ยนแปลง
tr: Değişti
uk: Змінено
vi: Đã thay đổi
zh_hans: 已更改
zh_hant: 已變更

# Hash_CopyAll.Content
source: Copy all
ar: نسخ الكل
cs: Kopírovat vše
de: Alle kopieren
el: Αντιγραφή όλων
es: Copiar todo
fa: رونوشت همه
fr: Tout copier
hu: Összes másolása
id: Salin semua
it: Copia tutto
ja: すべてコピー
ko: 모두 복사
pl: Kopiuj wszystko
pt: Copiar tudo
ro: Copiere totală
ru: Копировать все
th: คัดลอกทั้งหมด
tr: Tümünü kopyala
uk: Копіювати все
vi: Sao chép tất cả
zh_hans: 全部复制
zh_hant: 全部複製

# Hash_CopyAllNameValue.Text
source: Copy all as "name: value"
ar: نسخ الكل بتنسيق "الاسم: القيمة"
cs: Kopírovat vše jako „název: hodnota“
de: Alle als „Name: Wert“ kopieren
el: Αντιγραφή όλων ως "όνομα: τιμή"
es: Copiar todo como “nombre: valor”
fa: رونوشت همه به‌صورت «نام: مقدار»
fr: Tout copier au format « nom : valeur »
hu: Összes másolása „név: érték” formában
id: Salin semua sebagai "nama: nilai"
it: Copia tutto come “nome: valore”
ja: すべてを「名前: 値」でコピー
ko: 모두 "이름: 값" 형식으로 복사
pl: Kopiuj wszystko jako „nazwa: wartość”
pt: Copiar tudo como “nome: valor”
ro: Copiere totală ca „nume: valoare”
ru: Копировать все как «имя: значение»
th: คัดลอกทั้งหมดเป็น "ชื่อ: ค่า"
tr: Tümünü "ad: değer" olarak kopyala
uk: Копіювати все як «назва: значення»
vi: Sao chép tất cả dạng "tên: giá trị"
zh_hans: 全部复制为“名称: 值”
zh_hant: 全部複製為「名稱：值」

# Hash_CopyAllChecksum.Text
source: Copy all as checksum lines
ar: نسخ الكل كأسطر مجموع اختباري
cs: Kopírovat vše jako řádky kontrolních součtů
de: Alle als Prüfsummenzeilen kopieren
el: Αντιγραφή όλων ως γραμμές αθροίσματος ελέγχου
es: Copiar todo como líneas de suma de comprobación
fa: رونوشت همه به‌صورت سطرهای چک‌سام
fr: Tout copier en lignes de somme de contrôle
hu: Összes másolása ellenőrzőösszeg-sorokként
id: Salin semua sebagai baris checksum
it: Copia tutto come righe di checksum
ja: すべてをチェックサムファイル形式でコピー
ko: 모두 체크섬 줄 형식으로 복사
pl: Kopiuj wszystko jako wiersze sum kontrolnych
pt: Copiar tudo como linhas de soma de verificação
ro: Copiere totală ca linii de sumă de control
ru: Копировать все как строки контрольных сумм
th: คัดลอกทั้งหมดเป็นบรรทัดเช็กซัม
tr: Tümünü sağlama toplamı satırları olarak kopyala
uk: Копіювати все як рядки контрольних сум
vi: Sao chép tất cả dạng dòng tổng kiểm tra
zh_hans: 全部复制为校验和行
zh_hant: 全部複製為總和檢查碼行

# Hash_CopyAllJson.Text
source: Copy all as JSON
ar: نسخ الكل بتنسيق JSON
cs: Kopírovat vše jako JSON
de: Alle als JSON kopieren
el: Αντιγραφή όλων ως JSON
es: Copiar todo como JSON
fa: رونوشت همه به‌صورت JSON
fr: Tout copier en JSON
hu: Összes másolása JSON formában
id: Salin semua sebagai JSON
it: Copia tutto come JSON
ja: すべてを JSON でコピー
ko: 모두 JSON으로 복사
pl: Kopiuj wszystko jako JSON
pt: Copiar tudo como JSON
ro: Copiere totală ca JSON
ru: Копировать все как JSON
th: คัดลอกทั้งหมดเป็น JSON
tr: Tümünü JSON olarak kopyala
uk: Копіювати все як JSON
vi: Sao chép tất cả dạng JSON
zh_hans: 全部复制为 JSON
zh_hant: 全部複製為 JSON

# Hash_CopyAllCsv.Text
source: Copy all as CSV
ar: نسخ الكل بتنسيق CSV
cs: Kopírovat vše jako CSV
de: Alle als CSV kopieren
el: Αντιγραφή όλων ως CSV
es: Copiar todo como CSV
fa: رونوشت همه به‌صورت CSV
fr: Tout copier en CSV
hu: Összes másolása CSV formában
id: Salin semua sebagai CSV
it: Copia tutto come CSV
ja: すべてを CSV でコピー
ko: 모두 CSV로 복사
pl: Kopiuj wszystko jako CSV
pt: Copiar tudo como CSV
ro: Copiere totală ca CSV
ru: Копировать все как CSV
th: คัดลอกทั้งหมดเป็น CSV
tr: Tümünü CSV olarak kopyala
uk: Копіювати все як CSV
vi: Sao chép tất cả dạng CSV
zh_hans: 全部复制为 CSV
zh_hant: 全部複製為 CSV

# Hash_CopyValue.Text
source: Copy value
ar: نسخ القيمة
cs: Kopírovat hodnotu
de: Wert kopieren
el: Αντιγραφή τιμής
es: Copiar valor
fa: رونوشت مقدار
fr: Copier la valeur
hu: Érték másolása
id: Salin nilai
it: Copia valore
ja: 値をコピー
ko: 값 복사
pl: Kopiuj wartość
pt: Copiar valor
ro: Copiere valoare
ru: Копировать значение
th: คัดลอกค่า
tr: Değeri kopyala
uk: Копіювати значення
vi: Sao chép giá trị
zh_hans: 复制值
zh_hant: 複製值

# Hash_CopyNameValue.Text
source: Copy as "name: value"
ar: نسخ بتنسيق "الاسم: القيمة"
cs: Kopírovat jako „název: hodnota“
de: Als „Name: Wert“ kopieren
el: Αντιγραφή ως "όνομα: τιμή"
es: Copiar como “nombre: valor”
fa: رونوشت به‌صورت «نام: مقدار»
fr: Copier au format « nom : valeur »
hu: Másolás „név: érték” formában
id: Salin sebagai "nama: nilai"
it: Copia come “nome: valore”
ja: 「名前: 値」でコピー
ko: "이름: 값" 형식으로 복사
pl: Kopiuj jako „nazwa: wartość”
pt: Copiar como “nome: valor”
ro: Copiere ca „nume: valoare”
ru: Копировать как «имя: значение»
th: คัดลอกเป็น "ชื่อ: ค่า"
tr: "ad: değer" olarak kopyala
uk: Копіювати як «назва: значення»
vi: Sao chép dạng "tên: giá trị"
zh_hans: 复制为“名称: 值”
zh_hant: 複製為「名稱：值」

# Hash_CopyChecksum.Text
source: Copy as checksum line
ar: نسخ كسطر مجموع اختباري
cs: Kopírovat jako řádek kontrolního součtu
de: Als Prüfsummenzeile kopieren
el: Αντιγραφή ως γραμμή αθροίσματος ελέγχου
es: Copiar como línea de suma de comprobación
fa: رونوشت به‌صورت سطر چک‌سام
fr: Copier en ligne de somme de contrôle
hu: Másolás ellenőrzőösszeg-sorként
id: Salin sebagai baris checksum
it: Copia come riga di checksum
ja: チェックサムファイル形式でコピー
ko: 체크섬 줄 형식으로 복사
pl: Kopiuj jako wiersz sumy kontrolnej
pt: Copiar como linha de soma de verificação
ro: Copiere ca linie de sumă de control
ru: Копировать как строку контрольной суммы
th: คัดลอกเป็นบรรทัดเช็กซัม
tr: Sağlama toplamı satırı olarak kopyala
uk: Копіювати як рядок контрольної суми
vi: Sao chép dạng dòng tổng kiểm tra
zh_hans: 复制为校验和行
zh_hant: 複製為總和檢查碼行

# Hash_SaveChecksum.Text
source: Save as checksum file...
ar: حفظ كملف مجموع اختباري...
cs: Uložit jako soubor kontrolních součtů...
de: Als Prüfsummendatei speichern...
el: Αποθήκευση ως αρχείο αθροίσματος ελέγχου...
es: Guardar como archivo de sumas de comprobación...
fa: ذخیره به‌صورت فایل چک‌سام...
fr: Enregistrer comme fichier de sommes de contrôle...
hu: Mentés ellenőrzőösszeg-fájlként...
id: Simpan sebagai file checksum...
it: Salva come file di checksum...
ja: チェックサムファイルとして保存...
ko: 체크섬 파일로 저장...
pl: Zapisz jako plik sum kontrolnych...
pt: Salvar como arquivo de soma de verificação...
ro: Salvare ca fișier de sume de control...
ru: Сохранить как файл контрольных сумм...
th: บันทึกเป็นไฟล์เช็กซัม...
tr: Sağlama toplamı dosyası olarak kaydet...
uk: Зберегти як файл контрольних сум...
vi: Lưu thành tệp tổng kiểm tra...
zh_hans: 另存为校验和文件...
zh_hant: 儲存為總和檢查碼檔案...

# Hash_CopyRow_Name
source: Copy the {0} value
ar: نسخ قيمة {0}
cs: Kopírovat hodnotu {0}
de: Wert von {0} kopieren
el: Αντιγραφή της τιμής {0}
es: Copiar el valor de {0}
fa: رونوشت مقدار {0}
fr: Copier la valeur {0}
hu: A(z) {0} érték másolása
id: Salin nilai {0}
it: Copia il valore {0}
ja: {0} の値をコピー
ko: {0} 값 복사
pl: Kopiuj wartość {0}
pt: Copiar o valor de {0}
ro: Copiere valoare {0}
ru: Копировать значение {0}
th: คัดลอกค่า {0}
tr: {0} değerini kopyala
uk: Копіювати значення {0}
vi: Sao chép giá trị {0}
zh_hans: 复制 {0} 值
zh_hant: 複製 {0} 的值

# Hash_Settings_Name
source: {0} settings
ar: إعدادات {0}
cs: Nastavení {0}
de: Einstellungen für {0}
el: Ρυθμίσεις {0}
es: Configuración de {0}
fa: تنظیمات {0}
fr: Paramètres de {0}
hu: {0} beállításai
id: Pengaturan {0}
it: Impostazioni di {0}
ja: {0} の設定
ko: {0} 설정
pl: Ustawienia {0}
pt: Configurações de {0}
ro: Setări {0}
ru: Параметры {0}
th: การตั้งค่า {0}
tr: {0} ayarları
uk: Параметри {0}
vi: Cài đặt {0}
zh_hans: {0} 设置
zh_hant: {0} 設定

# Hash_Seed
source: Seed
ar: البذرة
cs: Počáteční hodnota
de: Startwert
el: Τιμή εκκίνησης (seed)
es: Semilla
fa: مقدار اولیه (Seed)
fr: Valeur initiale
hu: Kezdőérték
it: Seme
ja: シード
ko: 시드
pl: Ziarno
pt: Semente
ro: Valoare inițială
ru: Начальное значение
th: ค่าเริ่มต้น (Seed)
tr: Başlangıç değeri
uk: Початкове значення
vi: Giá trị khởi tạo
zh_hans: 种子
zh_hant: 種子

# Hash_SeedInvalid
source: Enter a decimal number or a hex number starting with 0x.
ar: أدخل رقماً عشرياً أو رقماً ست عشرياً يبدأ بـ 0x.
cs: Zadejte desítkové číslo nebo šestnáctkové číslo začínající 0x.
de: Geben Sie eine Dezimalzahl oder eine mit 0x beginnende Hexadezimalzahl ein.
el: Εισαγάγετε δεκαδικό αριθμό ή δεκαεξαδικό αριθμό που ξεκινά με 0x.
es: Escribe un número decimal o un número hexadecimal que empiece por 0x.
fa: یک عدد دهدهی یا یک عدد Hex که با 0x شروع می‌شود وارد کنید.
fr: Entrez un nombre décimal ou un nombre hexadécimal commençant par 0x.
hu: Adjon meg egy decimális számot vagy egy 0x kezdetű hexadecimális számot.
id: Masukkan angka desimal atau angka hex yang diawali 0x.
it: Immetti un numero decimale o un numero esadecimale che inizia con 0x.
ja: 10 進数、または 0x で始まる 16 進数を入力してください。
ko: 10진수 또는 0x로 시작하는 16진수를 입력하세요.
pl: Wprowadź liczbę dziesiętną lub szesnastkową zaczynającą się od 0x.
pt: Insira um número decimal ou um número hexadecimal começando com 0x.
ro: Introduceți un număr zecimal sau un număr hex care începe cu 0x.
ru: Введите десятичное число или шестнадцатеричное число, начинающееся с 0x.
th: โปรดใส่เลขฐานสิบ หรือเลขฐานสิบหกที่ขึ้นต้นด้วย 0x
tr: Ondalık bir sayı veya 0x ile başlayan bir hex sayı girin.
uk: Введіть десяткове число або шістнадцяткове число, що починається з 0x.
vi: Hãy nhập số thập phân hoặc số hex bắt đầu bằng 0x.
zh_hans: 请输入十进制数或以 0x 开头的十六进制数。
zh_hant: 請輸入十進位數字，或以 0x 開頭的十六進位數字。

# Hash_Complement
source: Complement of the result
ar: متمم النتيجة
cs: Doplněk výsledku
de: Komplement des Ergebnisses
el: Συμπλήρωμα του αποτελέσματος
es: Complemento del resultado
fa: مکمل نتیجه
fr: Complément du résultat
hu: Az eredmény komplemense
id: Komplemen hasil
it: Complemento del risultato
ja: 結果の補数
ko: 결과의 보수
pl: Uzupełnienie wyniku
pt: Complemento do resultado
ro: Complementul rezultatului
ru: Дополнение результата
th: ส่วนเติมเต็มของผลลัพธ์
tr: Sonucun tümleyeni
uk: Доповнення результату
vi: Bù của kết quả
zh_hans: 结果取补
zh_hant: 結果的補數

# Hash_Complement_None
source: None
ar: بلا
cs: Žádný
de: Keines
el: Κανένα
es: Ninguno
fa: هیچ
fr: Aucun
hu: Nincs
id: Tidak ada
it: Nessuno
ja: なし
ko: 없음
pl: Brak
pt: Nenhum
ro: Niciunul
ru: Нет
th: ไม่มี
tr: Yok
uk: Немає
vi: Không
zh_hans: 无
zh_hant: 無

# Hash_Complement_Ones
source: Ones' complement
ar: المتمم الأحادي
cs: Jedničkový doplněk
de: Einerkomplement
el: Συμπλήρωμα ως προς 1
es: Complemento a uno
fa: مکمل یک
fr: Complément à un
hu: Egyes komplemens
id: Komplemen satu
it: Complemento a uno
ja: 1 の補数
ko: 1의 보수
pl: Uzupełnienie do jedności
pt: Complemento de um
ro: Complement față de unu
ru: Обратный код (дополнение до 1)
th: ส่วนเติมเต็มหนึ่ง
tr: Bire tümleyen
uk: Обернений код
vi: Bù một
zh_hans: 反码（1 的补码）
zh_hant: 一補數

# Hash_Complement_Twos
source: Two's complement
ar: المتمم الثنائي
cs: Dvojkový doplněk
de: Zweierkomplement
el: Συμπλήρωμα ως προς 2
es: Complemento a dos
fa: مکمل دو
fr: Complément à deux
hu: Kettes komplemens
id: Komplemen dua
it: Complemento a due
ja: 2 の補数
ko: 2의 보수
pl: Uzupełnienie do dwóch
pt: Complemento de dois
ro: Complement față de doi
ru: Дополнительный код (дополнение до 2)
th: ส่วนเติมเต็มสอง
tr: İkiye tümleyen
uk: Додатковий код
vi: Bù hai
zh_hans: 补码（2 的补码）
zh_hant: 二補數

# Hash_ApplySettings
source: Apply
ar: تطبيق
cs: Použít
de: Übernehmen
el: Εφαρμογή
es: Aplicar
fa: اعمال
fr: Appliquer
hu: Alkalmaz
id: Terapkan
it: Applica
ja: 適用
ko: 적용
pl: Zastosuj
pt: Aplicar
ro: Aplicare
ru: Применить
th: นำไปใช้
tr: Uygula
uk: Застосувати
vi: Áp dụng
zh_hans: 应用
zh_hant: 套用

# Hash_Saved
source: Saved {0}.
ar: تم حفظ {0}.
cs: Uloženo: {0}.
de: {0} wurde gespeichert.
el: Αποθηκεύτηκε το {0}.
es: Se guardó {0}.
fa: {0} ذخیره شد.
fr: {0} a été enregistré.
hu: Mentve: {0}.
id: {0} disimpan.
it: Salvato {0}.
ja: {0} を保存しました。
ko: {0}을(를) 저장했습니다.
pl: Zapisano {0}.
pt: {0} salvo.
ro: S-a salvat {0}.
ru: Сохранено: {0}.
th: บันทึก {0} แล้ว
tr: {0} kaydedildi.
uk: Збережено {0}.
vi: Đã lưu {0}.
zh_hans: 已保存 {0}。
zh_hant: 已儲存 {0}。

# Hash_SaveFailed
source: Couldn't access the file: {0}
ar: تعذّر الوصول إلى الملف: {0}
cs: K souboru nelze získat přístup: {0}
de: Auf die Datei kann nicht zugegriffen werden: {0}
el: Δεν ήταν δυνατή η πρόσβαση στο αρχείο: {0}
es: No se pudo acceder al archivo: {0}
fa: دسترسی به فایل ممکن نشد: {0}
fr: Impossible d'accéder au fichier : {0}
hu: Nem sikerült hozzáférni a fájlhoz: {0}
id: Tidak dapat mengakses file: {0}
it: Impossibile accedere al file: {0}
ja: ファイルにアクセスできません: {0}
ko: 파일에 액세스할 수 없습니다: {0}
pl: Nie można uzyskać dostępu do pliku: {0}
pt: Não foi possível acessar o arquivo: {0}
ro: Nu s-a putut accesa fișierul: {0}
ru: Не удалось получить доступ к файлу: {0}
th: ไม่สามารถเข้าถึงไฟล์ได้: {0}
tr: Dosyaya erişilemedi: {0}
uk: Не вдалося отримати доступ до файлу: {0}
vi: Không thể truy cập tệp: {0}
zh_hans: 无法访问文件：{0}
zh_hant: 無法存取檔案：{0}

# Hash_VerifyTitle.Text
source: Verify
ar: التحقق
cs: Ověření
de: Überprüfen
el: Επαλήθευση
es: Verificar
fa: تأیید
fr: Vérifier
hu: Ellenőrzés
id: Verifikasi
it: Verifica
ja: 照合
ko: 확인
pl: Weryfikuj
pt: Verificar
ro: Verificare
ru: Проверка
th: ตรวจสอบ
tr: Doğrula
uk: Перевірка
vi: Xác minh
zh_hans: 验证
zh_hant: 驗證

# Hash_Expected.Header
source: Expected value
ar: القيمة المتوقعة
cs: Očekávaná hodnota
de: Erwarteter Wert
el: Αναμενόμενη τιμή
es: Valor esperado
fa: مقدار مورد انتظار
fr: Valeur attendue
hu: Várt érték
id: Nilai yang diharapkan
it: Valore previsto
ja: 期待値
ko: 예상 값
pl: Oczekiwana wartość
pt: Valor esperado
ro: Valoare așteptată
ru: Ожидаемое значение
th: ค่าที่คาดหวัง
tr: Beklenen değer
uk: Очікуване значення
vi: Giá trị mong đợi
zh_hans: 预期值
zh_hant: 預期值

# Hash_Expected.PlaceholderText
source: Paste a hex or Base64 value
ar: الصق قيمة Hex أو Base64
cs: Vložte hodnotu Hex nebo Base64
de: Hex- oder Base64-Wert einfügen
el: Επικολλήστε μια τιμή Hex ή Base64
es: Pega un valor Hex o Base64
fa: یک مقدار Hex یا Base64 بچسبانید
fr: Collez une valeur Hex ou Base64
hu: Illesszen be egy hexadecimális vagy Base64 értéket
id: Tempel nilai hex atau Base64
it: Incolla un valore esadecimale o Base64
ja: 16 進または Base64 の値を貼り付け
ko: Hex 또는 Base64 값 붙여넣기
pl: Wklej wartość szesnastkową lub Base64
pt: Cole um valor hexadecimal ou Base64
ro: Lipiți o valoare hex sau Base64
ru: Вставьте значение Hex или Base64
th: วางค่า Hex หรือ Base64
tr: Bir hex veya Base64 değeri yapıştırın
uk: Вставте значення Hex або Base64
vi: Dán giá trị hex hoặc Base64
zh_hans: 粘贴 Hex 或 Base64 值
zh_hant: 貼上 Hex 或 Base64 值

# Hash_ExpectedError.Text
source: Enter a hex or Base64 value.
ar: أدخل قيمة Hex أو Base64.
cs: Zadejte hodnotu Hex nebo Base64.
de: Geben Sie einen Hex- oder Base64-Wert ein.
el: Εισαγάγετε μια τιμή Hex ή Base64.
es: Escribe un valor Hex o Base64.
fa: یک مقدار Hex یا Base64 وارد کنید.
fr: Entrez une valeur Hex ou Base64.
hu: Adjon meg egy hexadecimális vagy Base64 értéket.
id: Masukkan nilai hex atau Base64.
it: Immetti un valore esadecimale o Base64.
ja: 16 進または Base64 の値を入力してください。
ko: Hex 또는 Base64 값을 입력하세요.
pl: Wprowadź wartość szesnastkową lub Base64.
pt: Insira um valor hexadecimal ou Base64.
ro: Introduceți o valoare hex sau Base64.
ru: Введите значение Hex или Base64.
th: โปรดใส่ค่า Hex หรือ Base64
tr: Bir hex veya Base64 değeri girin.
uk: Введіть значення Hex або Base64.
vi: Hãy nhập giá trị hex hoặc Base64.
zh_hans: 请输入 Hex 或 Base64 值。
zh_hant: 請輸入 Hex 或 Base64 值。

# Hash_Match
source: Match
ar: متطابقة
cs: Shoda
de: Übereinstimmung
el: Ταιριάζει
es: Coincide
fa: منطبق
fr: Correspondance
hu: Egyezik
id: Cocok
it: Corrisponde
ja: 一致
ko: 일치
pl: Zgodne
pt: Corresponde
ro: Coincide
ru: Совпадает
th: ตรงกัน
tr: Eşleşiyor
uk: Збігається
vi: Khớp
zh_hans: 匹配
zh_hant: 相符

# Hash_MatchReversed
source: Match (reversed byte order)
ar: متطابقة (ترتيب بايتات معكوس)
cs: Shoda (obrácené pořadí bajtů)
de: Übereinstimmung (umgekehrte Bytereihenfolge)
el: Ταιριάζει (αντίστροφη σειρά byte)
es: Coincide (orden de bytes invertido)
fa: منطبق (ترتیب بایت معکوس)
fr: Correspondance (ordre des octets inversé)
hu: Egyezik (fordított bájtsorrend)
id: Cocok (urutan byte terbalik)
it: Corrisponde (ordine dei byte invertito)
ja: 一致 (バイト順が逆)
ko: 일치(바이트 순서 반대)
pl: Zgodne (odwrócona kolejność bajtów)
pt: Corresponde (ordem dos bytes invertida)
ro: Coincide (ordinea octeților inversată)
ru: Совпадает (обратный порядок байтов)
th: ตรงกัน (ลำดับไบต์กลับด้าน)
tr: Eşleşiyor (ters bayt sırası)
uk: Збігається (зворотний порядок байтів)
vi: Khớp (thứ tự byte đảo ngược)
zh_hans: 匹配（字节顺序相反）
zh_hant: 相符（位元組順序相反）

# Hash_NoMatch
source: No match
ar: غير متطابقة
cs: Neshoda
de: Keine Übereinstimmung
el: Δεν ταιριάζει
es: No coincide
fa: منطبق نیست
fr: Aucune correspondance
hu: Nem egyezik
id: Tidak cocok
it: Non corrisponde
ja: 不一致
ko: 불일치
pl: Niezgodne
pt: Não corresponde
ro: Nu coincide
ru: Не совпадает
th: ไม่ตรงกัน
tr: Eşleşmiyor
uk: Не збігається
vi: Không khớp
zh_hans: 不匹配
zh_hant: 不相符

# Hash_VerifyFile.Content
source: Verify with checksum file...
ar: التحقق باستخدام ملف مجموع اختباري...
cs: Ověřit souborem kontrolních součtů...
de: Mit Prüfsummendatei überprüfen...
el: Επαλήθευση με αρχείο αθροίσματος ελέγχου...
es: Verificar con archivo de sumas de comprobación...
fa: تأیید با فایل چک‌سام...
fr: Vérifier avec un fichier de sommes de contrôle...
hu: Ellenőrzés ellenőrzőösszeg-fájllal...
id: Verifikasi dengan file checksum...
it: Verifica con file di checksum...
ja: チェックサムファイルで検証...
ko: 체크섬 파일로 확인...
pl: Weryfikuj za pomocą pliku sum kontrolnych...
pt: Verificar com arquivo de soma de verificação...
ro: Verificare cu fișier de sume de control...
ru: Проверить по файлу контрольных сумм...
th: ตรวจสอบด้วยไฟล์เช็กซัม...
tr: Sağlama toplamı dosyasıyla doğrula...
uk: Перевірити за файлом контрольних сум...
vi: Xác minh bằng tệp tổng kiểm tra...
zh_hans: 使用校验和文件验证...
zh_hant: 以總和檢查碼檔案驗證...

# Hash_VerifyLines.AutomationProperties.Name
source: Lines in the checksum file
ar: الأسطر في ملف المجموع الاختباري
cs: Řádky v souboru kontrolních součtů
de: Zeilen der Prüfsummendatei
el: Γραμμές στο αρχείο αθροίσματος ελέγχου
es: Líneas del archivo de sumas de comprobación
fa: سطرهای فایل چک‌سام
fr: Lignes du fichier de sommes de contrôle
hu: Az ellenőrzőösszeg-fájl sorai
id: Baris dalam file checksum
it: Righe del file di checksum
ja: チェックサムファイルの行
ko: 체크섬 파일의 줄
pl: Wiersze pliku sum kontrolnych
pt: Linhas do arquivo de soma de verificação
ro: Liniile din fișierul de sume de control
ru: Строки файла контрольных сумм
th: บรรทัดในไฟล์เช็กซัม
tr: Sağlama toplamı dosyasındaki satırlar
uk: Рядки у файлі контрольних сум
vi: Các dòng trong tệp tổng kiểm tra
zh_hans: 校验和文件中的行
zh_hant: 總和檢查碼檔案中的行

# Hash_VerifyLineNotFound
source: There's no line for this file. Choose a line from the list.
ar: لا يوجد سطر لهذا الملف. اختر سطراً من القائمة.
cs: Pro tento soubor neexistuje žádný řádek. Vyberte řádek ze seznamu.
de: Für diese Datei gibt es keine Zeile. Wählen Sie eine Zeile aus der Liste aus.
el: Δεν υπάρχει γραμμή για αυτό το αρχείο. Επιλέξτε μια γραμμή από τη λίστα.
es: No hay ninguna línea para este archivo. Elige una línea de la lista.
fa: سطری برای این فایل وجود ندارد. سطری را از فهرست انتخاب کنید.
fr: Aucune ligne ne correspond à ce fichier. Choisissez une ligne dans la liste.
hu: Ehhez a fájlhoz nincs sor. Válasszon egy sort a listából.
id: Tidak ada baris untuk file ini. Pilih baris dari daftar.
it: Non c'è alcuna riga per questo file. Scegli una riga dall'elenco.
ja: このファイルの行が見つかりません。一覧から行を選んでください。
ko: 이 파일에 해당하는 줄이 없습니다. 목록에서 줄을 선택하세요.
pl: Brak wiersza dla tego pliku. Wybierz wiersz z listy.
pt: Não há uma linha para este arquivo. Escolha uma linha na lista.
ro: Nu există nicio linie pentru acest fișier. Alegeți o linie din listă.
ru: Для этого файла нет строки. Выберите строку в списке.
th: ไม่มีบรรทัดสำหรับไฟล์นี้ โปรดเลือกบรรทัดจากรายการ
tr: Bu dosya için bir satır yok. Listeden bir satır seçin.
uk: Для цього файлу немає рядка. Виберіть рядок зі списку.
vi: Không có dòng nào cho tệp này. Hãy chọn một dòng trong danh sách.
zh_hans: 没有对应此文件的行。请从列表中选择一行。
zh_hant: 找不到此檔案的行。請從清單中選擇一行。

# Hash_VerifyUnknownAlgorithm
source: Can't tell which algorithm this line uses.
ar: يتعذّر تحديد الخوارزمية التي يستخدمها هذا السطر.
cs: Nelze určit, jaký algoritmus tento řádek používá.
de: Der Algorithmus dieser Zeile ist nicht erkennbar.
el: Δεν είναι δυνατό να προσδιοριστεί ο αλγόριθμος αυτής της γραμμής.
es: No se puede saber qué algoritmo usa esta línea.
fa: مشخص نیست این سطر از کدام الگوریتم استفاده می‌کند.
fr: Impossible de déterminer l'algorithme utilisé par cette ligne.
hu: Nem állapítható meg, melyik algoritmust használja ez a sor.
id: Tidak dapat mengetahui algoritma yang digunakan baris ini.
it: Impossibile determinare l'algoritmo usato da questa riga.
ja: この行のアルゴリズムが分かりません。
ko: 이 줄에서 사용하는 알고리즘을 알 수 없습니다.
pl: Nie można ustalić, jakiego algorytmu używa ten wiersz.
pt: Não é possível determinar qual algoritmo esta linha usa.
ro: Nu se poate determina ce algoritm utilizează această linie.
ru: Не удается определить алгоритм этой строки.
th: ไม่สามารถระบุอัลกอริทึมที่บรรทัดนี้ใช้ได้
tr: Bu satırın hangi algoritmayı kullandığı anlaşılamıyor.
uk: Не вдається визначити алгоритм цього рядка.
vi: Không xác định được thuật toán của dòng này.
zh_hans: 无法确定此行使用的算法。
zh_hant: 無法判斷此行使用的演算法。
